# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

# TODO: your code here
t1 = (11, 7, 16, 8, 0, 23)
t2 = (4, 15, 23, 99, 11, 46)
t3 = (22, 48, 7, 11, 44, 45)
i = 0
u = 0
l = 0
res = 0
while i < len(t1):
    while u < len(t2):
        if t1[i] == t2[u]:
            while l < len(t3):
                if t1[i] == t3[l]:
                    res += 1
                    l += 1
                else:
                    l += 1
            u += 1
        else:
            u += 1
    i += 1
print(res)
